trade_exp/src/InformationRegisters/ПроцентНаценкиГруппыВидовЦен/ПроцентНаценкиГруппыВидовЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fff62856-3aa4-48c3-90ea-02b6d5b33b95">
  <name>ПроцентНаценкиГруппыВидовЦен</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="ed818daa-488d-4552-aa98-5788f5619105">
    <name>ПроцентНаценки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="f022f2a4-038c-4433-ad5e-7fcd551bf0c7">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3bc0c4e4-a69f-4cf1-9254-5134a2defaef">
    <name>Инициатор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="5656f6aa-4b5f-4e92-933d-7009769eeeec">
    <name>ГруппаВидовЦен</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="08a14fd0-6e98-4452-aee8-420fd2a6cad5">
    <name>Регион</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="375442c2-53d3-404f-9882-23d14604f3ff">
    <name>ТипЗаписи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="623cdb2d-139f-4e7f-8a57-d113e1caaab8">
    <name>ЦеноваяГруппа_Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="747e3d32-119e-4cdd-b6ed-7566483837c5">
    <name>Начало</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="51b6297b-1a66-421d-a41b-6c307f71f67e">
    <name>Окончание</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ПроцентНаценкиГруппыВидовЦен/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СоздатьОбщая(Команда)
	
	ОткрытьФорму("РегистрСведений.ПроцентНаценкиГруппыВидовЦен.ФормаЗаписи",Новый Структура("ТипЗаписи",2));
	
КонецПроцедуры


&НаКлиенте
Процедура СоздатьПоЦеновойГруппе(Команда)
	
	ОткрытьФорму("РегистрСведений.ПроцентНаценкиГруппыВидовЦен.ФормаЗаписи",Новый Структура("ТипЗаписи",1));
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПоНоменклатуре(Команда)
	ОткрытьФорму("РегистрСведений.ПроцентНаценкиГруппыВидовЦен.ФормаЗаписи",Новый Структура("ТипЗаписи",0));
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла_ЦеноваяГруппа(Команда)
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузкиИзФайла_ЦеноваяГруппа", ЭтотОбъект);
	ПараметрыФормы= Новый Структура;
	ПараметрыФормы.Вставить("ДополнительныеРеквизиты",Новый Структура("Инициатор","СправочникСсылка.Пользователи#Инициатор#10")); 
	ПараметрыФормы.Вставить("НастройкиТаблицы", СтруктураТаблицы_ЦеноваяГруппа());
	ОткрытьФорму("Обработка.ЗагрузкаИзВнешнегоФайла_Альтерра.Форма.ФормаПроизвольная", ПараметрыФормы, ЭтотОбъект, , ,
		, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
		
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла_Номенклатура(Команда)
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузкиИзФайла_Номенклатура", ЭтотОбъект);
	ПараметрыФормы= Новый Структура;
	ПараметрыФормы.Вставить("ДополнительныеРеквизиты",Новый Структура("Инициатор","СправочникСсылка.Пользователи#Инициатор#10")); 
	ПараметрыФормы.Вставить("НастройкиТаблицы", СтруктураТаблицы_Номенклатура());
	ОткрытьФорму("Обработка.ЗагрузкаИзВнешнегоФайла_Альтерра.Форма.ФормаПроизвольная", ПараметрыФормы, ЭтотОбъект, , ,
		, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла_Общая(Команда)
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузкиИзФайла_Общая", ЭтотОбъект);
	ПараметрыФормы= Новый Структура;
	ПараметрыФормы.Вставить("ДополнительныеРеквизиты",Новый Структура("Инициатор","СправочникСсылка.Пользователи#Инициатор#10")); 
	ПараметрыФормы.Вставить("НастройкиТаблицы", СтруктураТаблицы_Общая());
	ОткрытьФорму("Обработка.ЗагрузкаИзВнешнегоФайла_Альтерра.Форма.ФормаПроизвольная", ПараметрыФормы, ЭтотОбъект, , ,
		, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыиФункции
&НаКлиенте
Функция СтруктураТаблицы_ЦеноваяГруппа()

	СтруктураТаблицы=Новый Структура;
	СтруктураТаблицы.Вставить("ГруппаВидовЦен", "СправочникСсылка.ГруппировкиВидовЦен#Группа видов цен#20#1#Справочники.ГруппировкиВидовЦен.НайтиПоНаименованию(""&Ячейка&"")#ГруппаВидовЦен");
	СтруктураТаблицы.Вставить("Регион", "СправочникСсылка.РегионыПрисутствия#Регион#20#1#Справочники.РегионыПрисутствия.НайтиПоНаименованию(""&Ячейка&"")#Регион");
	СтруктураТаблицы.Вставить("ЦеноваяГруппа_Номенклатура",
		"СправочникСсылка.ЦеновыеГруппы#Ценовая группа#30#1#Справочники.ЦеновыеГруппы.НайтиПоНаименованию(""&Ячейка&"")#ЦеноваяГруппа_Номенклатура");
	СтруктураТаблицы.Вставить("ПроцентНаценки", "число#% наценки#10");
	
	Возврат СтруктураТаблицы;
КонецФункции

&НаКлиенте
Функция СтруктураТаблицы_Номенклатура()

	СтруктураТаблицы=Новый Структура;
	СтруктураТаблицы.Вставить("ГруппаВидовЦен", "СправочникСсылка.ГруппировкиВидовЦен#Группа видов цен#20#1#Справочники.ГруппировкиВидовЦен.НайтиПоНаименованию(""&Ячейка&"")#ГруппаВидовЦен");
	СтруктураТаблицы.Вставить("Регион", "СправочникСсылка.РегионыПрисутствия#Регион#20#1#Справочники.РегионыПрисутствия.НайтиПоНаименованию(""&Ячейка&"")#Регион");
	СтруктураТаблицы.Вставить("Код", "строка#Код номенклатуры#15#1#Справочники.Номенклатура.НайтиПоКоду(""&Ячейка&"")#ЦеноваяГруппа_Номенклатура");
	СтруктураТаблицы.Вставить("ЦеноваяГруппа_Номенклатура",
		"СправочникСсылка.Номенклатура#Номенклатура#30#1#Справочники.Номенклатура.НайтиПоНаименованию(""&Ячейка&"")#ЦеноваяГруппа_Номенклатура");
	СтруктураТаблицы.Вставить("Начало", "Дата#Начало#10");
	СтруктураТаблицы.Вставить("Окончание", "Дата#Окончание#10");
	СтруктураТаблицы.Вставить("ПроцентНаценки", "число#% наценки#10");
	
	Возврат СтруктураТаблицы;
КонецФункции

&НаКлиенте
Функция СтруктураТаблицы_Общая()

	СтруктураТаблицы=Новый Структура;
	СтруктураТаблицы.Вставить("ГруппаВидовЦен", "СправочникСсылка.ГруппировкиВидовЦен#Группа видов цен#20#1#Справочники.ГруппировкиВидовЦен.НайтиПоНаименованию(""&Ячейка&"")#ГруппаВидовЦен");
	СтруктураТаблицы.Вставить("Регион", "СправочникСсылка.РегионыПрисутствия#Регион#20#1#Справочники.РегионыПрисутствия.НайтиПоНаименованию(""&Ячейка&"")#Регион");
	СтруктураТаблицы.Вставить("ПроцентНаценки", "число#% наценки#10");
	
	Возврат СтруктураТаблицы;
КонецФункции

&НаКлиенте
Процедура ПослеЗагрузкиИзФайла_Общая(Результат, ДополнительныеПараметры) Экспорт

	ПослеЗагрузкиИзФайлаСервер_Общая(Результат, ДополнительныеПараметры);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗагрузкиИзФайла_Номенклатура(Результат, ДополнительныеПараметры) Экспорт

	ПослеЗагрузкиИзФайлаСервер_Номенклатура(Результат, ДополнительныеПараметры);

КонецПроцедуры


&НаКлиенте
Процедура ПослеЗагрузкиИзФайла_ЦеноваяГруппа(Результат, ДополнительныеПараметры) Экспорт

	ПослеЗагрузкиИзФайлаСервер_ЦеноваяГруппа(Результат, ДополнительныеПараметры);

КонецПроцедуры

&НаСервере
Процедура ПослеЗагрузкиИзФайлаСервер_Общая(Результат, ДополнительныеПараметры)

	Если Не Результат = Неопределено Тогда
		ТаблицаДанных=ПолучитьИзВременногоХранилища(Результат);
		Если ТаблицаДанных <> Неопределено Тогда
			Для Каждого стр Из ТаблицаДанных Цикл
				МенеджерЗаписи=РегистрыСведений.ПроцентНаценкиГруппыВидовЦен.СоздатьМенеджерЗаписи();
				заполнитьзначениясвойств(МенеджерЗаписи, стр);
				МенеджерЗаписи.Период=ТекущаяДатаСеанса();
				МенеджерЗаписи.ТипЗаписи=2;
				МенеджерЗаписи.Записать(Истина);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
Элементы.СписокОбщая.Обновить();
КонецПроцедуры

&НаСервере
Процедура ПослеЗагрузкиИзФайлаСервер_ЦеноваяГруппа(Результат, ДополнительныеПараметры)

	Если Не Результат = Неопределено Тогда
		ТаблицаДанных=ПолучитьИзВременногоХранилища(Результат);
		Если ТаблицаДанных <> Неопределено Тогда
			Для Каждого стр Из ТаблицаДанных Цикл
				МенеджерЗаписи=РегистрыСведений.ПроцентНаценкиГруппыВидовЦен.СоздатьМенеджерЗаписи();
				заполнитьзначениясвойств(МенеджерЗаписи, стр);
				МенеджерЗаписи.Период=ТекущаяДатаСеанса();
				МенеджерЗаписи.ТипЗаписи=1;
				МенеджерЗаписи.Записать(Истина);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
Элементы.СписокЦеноваяГруппа.Обновить();
КонецПроцедуры

&НаСервере
Процедура ПослеЗагрузкиИзФайлаСервер_Номенклатура(Результат, ДополнительныеПараметры)

	Если Не Результат = Неопределено Тогда
		ТаблицаДанных=ПолучитьИзВременногоХранилища(Результат);
		Если ТаблицаДанных <> Неопределено Тогда
			Для Каждого стр Из ТаблицаДанных Цикл
				МенеджерЗаписи=РегистрыСведений.ПроцентНаценкиГруппыВидовЦен.СоздатьМенеджерЗаписи();
				заполнитьзначениясвойств(МенеджерЗаписи, стр);
				МенеджерЗаписи.Период=ТекущаяДатаСеанса();
				МенеджерЗаписи.Записать(Истина);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
Элементы.СписокНоменклатура.Обновить();
КонецПроцедуры

#КонецОбласти
